bench/scale_fio/fio_logs/rfuse/write_128k_1.log
write: (g=0): rw=write, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=psync, iodepth=1
fio-3.16
Starting 1 process

write: (groupid=0, jobs=1): err= 0: pid=279056: Thu Oct  9 16:47:51 2025
  write: IOPS=4057, BW=507MiB/s (532MB/s)(1024MiB/2019msec); 0 zone resets
    clat (usec): min=44, max=8086, avg=72.63, stdev=213.87
     lat (usec): min=44, max=8089, avg=73.11, stdev=213.95
    clat percentiles (usec):
     |  1.00th=[   57],  5.00th=[   59], 10.00th=[   60], 20.00th=[   61],
     | 30.00th=[   62], 40.00th=[   62], 50.00th=[   63], 60.00th=[   65],
     | 70.00th=[   67], 80.00th=[   70], 90.00th=[   77], 95.00th=[   82],
     | 99.00th=[  117], 99.50th=[  153], 99.90th=[ 2073], 99.95th=[ 7963],
     | 99.99th=[ 8094]
   bw (  MiB/s): min= 1677, max= 1677, per=100.00%, avg=1677.00, stdev= 0.00, samples=1
   iops        : min=13416, max=13416, avg=13416.00, stdev= 0.00, samples=1
  lat (usec)   : 50=0.07%, 100=98.19%, 250=1.54%, 500=0.07%
  lat (msec)   : 2=0.01%, 4=0.04%, 10=0.07%
  cpu          : usr=0.35%, sys=17.05%, ctx=8200, majf=0, minf=11
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,8192,0,1 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=507MiB/s (532MB/s), 507MiB/s-507MiB/s (532MB/s-532MB/s), io=1024MiB (1074MB), run=2019-2019msec