bench/scale_fio/fio_logs/rfuse/write_128k_4.log
write: (g=0): rw=write, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=psync, iodepth=1
...
fio-3.16
Starting 4 processes

write: (groupid=0, jobs=4): err= 0: pid=279500: Thu Oct  9 16:48:03 2025
  write: IOPS=4469, BW=559MiB/s (586MB/s)(4096MiB/7331msec); 0 zone resets
    clat (usec): min=66, max=8092, avg=173.23, stdev=309.21
     lat (usec): min=66, max=8099, avg=173.75, stdev=309.27
    clat percentiles (usec):
     |  1.00th=[   88],  5.00th=[  110], 10.00th=[  135], 20.00th=[  143],
     | 30.00th=[  149], 40.00th=[  153], 50.00th=[  157], 60.00th=[  161],
     | 70.00th=[  167], 80.00th=[  174], 90.00th=[  186], 95.00th=[  223],
     | 99.00th=[  273], 99.50th=[  289], 99.90th=[ 7963], 99.95th=[ 8029],
     | 99.99th=[ 8094]
   bw (  MiB/s): min= 2785, max= 2927, per=100.00%, avg=2856.50, stdev=21.68, samples=8
   iops        : min=22286, max=23418, avg=22852.00, stdev=173.46, samples=8
  lat (usec)   : 100=2.48%, 250=95.20%, 500=2.05%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.07%, 10=0.17%
  cpu          : usr=0.04%, sys=17.91%, ctx=32807, majf=0, minf=40
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,32768,0,4 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=559MiB/s (586MB/s), 559MiB/s-559MiB/s (586MB/s-586MB/s), io=4096MiB (4295MB), run=7331-7331msec