bench/scale_fio/fio_logs/rfuse/write_4k_16.log
write: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
...
fio-3.16
Starting 16 processes

write: (groupid=0, jobs=16): err= 0: pid=273185: Thu Oct  9 16:46:33 2025
  write: IOPS=111k, BW=434MiB/s (455MB/s)(16.0GiB/37753msec); 0 zone resets
    clat (usec): min=3, max=517801, avg=99.49, stdev=2157.80
     lat (usec): min=3, max=517801, avg=99.53, stdev=2157.81
    clat percentiles (usec):
     |  1.00th=[    4],  5.00th=[    5], 10.00th=[    6], 20.00th=[    8],
     | 30.00th=[    9], 40.00th=[   12], 50.00th=[   30], 60.00th=[   43],
     | 70.00th=[   54], 80.00th=[   59], 90.00th=[   76], 95.00th=[   89],
     | 99.00th=[  105], 99.50th=[  117], 99.90th=[ 8094], 99.95th=[52691],
     | 99.99th=[83362]
   bw (  KiB/s): min=185871, max=1346280, per=100.00%, avg=642216.84, stdev=18709.40, samples=825
   iops        : min=46467, max=336570, avg=160554.04, stdev=4677.36, samples=825
  lat (usec)   : 4=1.08%, 10=35.88%, 20=9.14%, 50=20.92%, 100=31.35%
  lat (usec)   : 250=1.37%, 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.04%, 10=0.08%, 20=0.01%, 50=0.04%
  lat (msec)   : 100=0.05%, 250=0.01%, 500=0.01%, 750=0.01%
  cpu          : usr=0.30%, sys=33.30%, ctx=4053868, majf=0, minf=171
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,4194304,0,16 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=434MiB/s (455MB/s), 434MiB/s-434MiB/s (455MB/s-455MB/s), io=16.0GiB (17.2GB), run=37753-37753msec