bench/scale_fio/fio_logs/rfuse/write_4k_4.log
write: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
...
fio-3.16
Starting 4 processes

write: (groupid=0, jobs=4): err= 0: pid=271203: Thu Oct  9 16:45:32 2025
  write: IOPS=88.6k, BW=346MiB/s (363MB/s)(4096MiB/11836msec); 0 zone resets
    clat (usec): min=3, max=9331, avg=14.26, stdev=94.61
     lat (usec): min=3, max=9331, avg=14.28, stdev=94.61
    clat percentiles (usec):
     |  1.00th=[    8],  5.00th=[    9], 10.00th=[   11], 20.00th=[   12],
     | 30.00th=[   12], 40.00th=[   13], 50.00th=[   13], 60.00th=[   14],
     | 70.00th=[   14], 80.00th=[   15], 90.00th=[   16], 95.00th=[   18],
     | 99.00th=[   23], 99.50th=[   30], 99.90th=[   78], 99.95th=[  112],
     | 99.99th=[ 7963]
   bw (  MiB/s): min=  974, max= 1187, per=100.00%, avg=1075.93, stdev=17.23, samples=28
   iops        : min=249596, max=304108, avg=275436.86, stdev=4411.47, samples=28
  lat (usec)   : 4=0.01%, 10=8.96%, 20=89.32%, 50=1.59%, 100=0.06%
  lat (usec)   : 250=0.04%, 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.02%
  cpu          : usr=0.71%, sys=27.68%, ctx=1045579, majf=0, minf=44
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,1048576,0,4 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=346MiB/s (363MB/s), 346MiB/s-346MiB/s (363MB/s-363MB/s), io=4096MiB (4295MB), run=11836-11836msec